#+TITLE: Metody przeszukiwania bezpośredniego dla funkcji jednowymiarowych
#+SUBTITLE: Optymalizacja nieliniowa - projekt 1
#+AUTHOR: Patryk Gronkiewicz 164157
#+LANGUAGE: pl
#+OPTIONS: toc:nil H:2 num:t
#+PROPERTY: header-args:R  :session *R*
#+BEAMER_THEME: Hannover
#+BEAMER_COLOR_THEME: orchid
#+BEAMER_FONT_THEME: professionalfonts
#+STARTUP: beamer

** Wyniki
Po wywołaniu funkcji używającej metody Fibonacciego otrzymujemy wynik podany poniżej.
#+NAME: fib_opt
#+begin_src R :exports both
fibonacci(f, 2, 10, 1e-10)
#+end_src

#+RESULTS: fib_opt
: 9.68645230555025

** Wyniki
Po wywołaniu funkcji używającej metody Newtona otrzymujemy wynik podany poniżej.
#+NAME: newton_opt
#+begin_src R :exports both
newton(f_exp, 10, 1e-10)
#+end_src

#+RESULTS: newton_opt
: 9.68645230138073

